{
  "profile": {
    "name": "Ayush Rana",
    "email": "rana.ay@northeastern.edu",
    "phone": "(510) 378-1302",
    "location": "",
    "url": "",
    "summary": ""
  },
  "educations": [
    {
      "school": "Northeastern University",
      "degree": "Bachelor’s of Science in Computer Science",
      "gpa": "3.7",
      "date": "Sep 2021 - May 2025",
      "descriptions": []
    },
    {
      "school": "",
      "degree": "",
      "gpa": "",
      "date": "",
      "descriptions": [
        "Relevant Coursework: Algorithms and Data Structures, Distributed Systems, Practical Neural Networks,",
        "Machine Learning and Data Mining, Natural Language Processing, Computer Systems, Object Oriented Design"
      ]
    }
  ],
  "workExperiences": [
    {
      "company": "Numerated, Fintech Startup Acquired by Moody’s -Software Engineering Intern",
      "jobTitle": "Numerated, Fintech Startup Acquired by Moody’s -Software Engineering Intern",
      "date": "Jul 2024 - Dec 2024",
      "descriptions": [
        "Designed and implemented a portfolio reporting feature usingDjangoandAngular, enabling users to generate customizable reports used to view and compare companies across the same portfolio.",
        "Collaborated with product and UX teams to scope and design the portfolio reporting feature, aligning with client needs and standards. Showcased this feature in securing a major contract with a Tier 1 bank.",
        "Reduced errors by 15% by resolving critical categorization issues of supplemental items on thefinancial summary page. This improvement ensured data consistency and provided a clearer user experience.",
        "Increased unit and integration test coverage by 80%, leading to higher regression detection rates and reducing the need for hotfixes during bi-weekly releases."
      ]
    },
    {
      "company": "Prepmate, Food Delivery Service Startup -FoundingSoftware Engineer",
      "jobTitle": "Prepmate, Food Delivery Service Startup -FoundingSoftware Engineer",
      "date": "Dec 2023 - Apr 2024",
      "descriptions": [
        "Simplified the ordering processby implementing features like meal customization, order status updates, restaurant categorization, andfiltering usingSupabase, TypeScript, andNext.js.",
        "Constructed a complex multi-cart ordering system, enabling users to manage orders simultaneously. This feature increased user engagement and generated$4,000in additional revenue.",
        "Deployed a subscription model using the Stripe API for automated, fee-free weekly orders, securing $300/month in recurring revenue."
      ]
    },
    {
      "company": "Kythera Space Solutions-Full Stack Software Engineering Intern",
      "jobTitle": "Kythera Space Solutions-Full Stack Software Engineering Intern",
      "date": "May 2023 - Dec 2023",
      "descriptions": [
        "Engineered microservice APIs using TypeScript, Prisma, and PostgreSQLto enhance a satellite tracking platform, resulting in a30%increase in real-time visualization accuracy for satellite locations and coverage areas. This improvement directly contributed to better decision-making for satellite companies.",
        "Created a modular React component librarywith over 40 components, ensuring UI consistency and brand identity across three internal teams and projects. This allowed developers to reuse components, improving development efficiency and maintaining a cohesive user experience."
      ]
    }
  ],
  "projects": [
    {
      "project": "Bindly, social media app blending accountability and betting",
      "date": "May 2024",
      "descriptions": [
        "Ideated and developed front end withSwiftand built aRESTful APIusingExpress.jsonAWS Lambda, leveragingSupabasefor database, storage, and authentication.",
        "Integrated Stripe and PayPal APIsto handle secure buy-ins and payouts, and devised a comprehensive logging system to maintain accurate records of allfinancial transactions. This ensured reliable transactions, quick recovery and troubleshooting of payment issues, and maintained balance integrity within the app.",
        "Optimized media handling with pre-signed URLs and compression for efficient storage and fast load times, reducing server stress and pagination to seamlessly display media.",
        "Leveragedcron jobsfor automatic storage cleanup and notifications to maximize user retention."
      ]
    },
    {
      "project": "NBA Game Predictor",
      "date": "Jul 2023",
      "descriptions": [
        "Feature engineered past 10 years of NBA game data to create rolling averages to measure game to game momentum usingPandas. Reduced features using Random Forest, to highlight more impactful features.",
        "BuiltTensorFlow ANNandXGBoostmodels to predict NBA games, achieving 95% accuracy."
      ]
    }
  ],
  "skills": {
    "featuredSkills": [
      {
        "skill": "",
        "rating": 4
      },
      {
        "skill": "",
        "rating": 4
      },
      {
        "skill": "",
        "rating": 4
      },
      {
        "skill": "",
        "rating": 4
      },
      {
        "skill": "",
        "rating": 4
      },
      {
        "skill": "",
        "rating": 4
      }
    ],
    "descriptions": [
      "Languages: Javascript, Python, Typescript, Java, Swift, Go, C, C++, C#, SQL, R",
      "Technologies: Rest APIs, Node.js, React, Express, Django, AWS, Angular, Docker, TensorFlow, Git, Pandas"
    ]
  },
  "custom": {
    "descriptions": []
  }
}